test_commands_fio
- Test write:
    fio --name=write_throughput --directory="/home/csdeptucy/ssfs" --numjobs=16 --size=4KB --time_based --runtime=60s --ramp_time=2s --ioengine=libaio --verify=0 --bs=4KB --iodepth=64 --rw=write --group_reporting=1 --iodepth_batch_submit=64 --iodepth_batch_complete_max=64

    Result:
    write_throughput: (groupid=0, jobs=16): err= 0: pid=4464: Sat May 27 13:47:07 2023
      write: IOPS=20.9k, BW=81.9MiB/s (85.8MB/s)(4918MiB/60077msec); 0 zone resets
        slat (msec): min=14, max=454, avg=48.77, stdev=42.91
        clat (usec): min=2, max=753, avg=13.87, stdev=19.31
         lat (msec): min=14, max=454, avg=48.79, stdev=42.92
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[    9], 50.00th=[    9], 60.00th=[   10],
         | 70.00th=[   10], 80.00th=[   11], 90.00th=[   14], 95.00th=[   64],
         | 99.00th=[   85], 99.50th=[  103], 99.90th=[  204], 99.95th=[  237],
         | 99.99th=[  338]
       bw (  KiB/s): min=13781, max=151374, per=100.00%, avg=83978.08, stdev=2756.10, samples=1912
       iops        : min= 3440, max=37842, avg=20991.34, stdev=688.95, samples=1912
      lat (usec)   : 4=0.93%, 10=70.24%, 20=20.97%, 50=1.17%, 100=6.11%
      lat (usec)   : 250=0.56%, 500=0.03%, 750=0.01%, 1000=0.01%
      cpu          : usr=0.20%, sys=2.23%, ctx=1260153, majf=0, minf=241
      IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
         submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         issued rwts: total=0,1258048,0,0 short=0,0,0,0 dropped=0,0,0,0
         latency   : target=0, window=0, percentile=100.00%, depth=64

    Run status group 0 (all jobs):
      WRITE: bw=81.9MiB/s (85.8MB/s), 81.9MiB/s-81.9MiB/s (85.8MB/s-85.8MB/s), io=4918MiB (5157MB), run=60077-60077msec

- Test read:
    fio --name=write_throughput --directory="/home/csdeptucy/ssfs" --numjobs=16 --size=4KB --time_based --runtime=60s --ramp_time=2s --ioengine=libaio --verify=0 --bs=4KB --iodepth=64 --rw=read --group_reporting=1 --iodepth_batch_submit=64 --iodepth_batch_complete_max=64
    Result:
    read: IOPS=21.2k, BW=82.9MiB/s (86.9MB/s)(4982MiB/60106msec)
        slat (msec): min=4, max=429, avg=48.17, stdev=39.15
        clat (usec): min=2, max=1015, avg=15.54, stdev=22.51
         lat (msec): min=4, max=429, avg=48.20, stdev=39.17
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    9], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[   10], 50.00th=[   10], 60.00th=[   11],
         | 70.00th=[   12], 80.00th=[   13], 90.00th=[   17], 95.00th=[   65],
         | 99.00th=[   94], 99.50th=[  120], 99.90th=[  233], 99.95th=[  281],
         | 99.99th=[  594]
       bw (  KiB/s): min= 8164, max=173402, per=99.93%, avg=84809.59, stdev=2540.00, samples=1920
       iops        : min= 2035, max=43348, avg=21198.88, stdev=634.99, samples=1920
      lat (usec)   : 4=0.75%, 10=54.23%, 20=36.31%, 50=1.49%, 100=6.39%
      lat (usec)   : 250=0.75%, 500=0.06%, 750=0.01%
      lat (msec)   : 2=0.01%
      cpu          : usr=0.22%, sys=2.17%, ctx=1294161, majf=0, minf=258
      IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
         submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         issued rwts: total=1274240,0,0,0 short=0,0,0,0 dropped=0,0,0,0
         latency   : target=0, window=0, percentile=100.00%, depth=64

    Run status group 0 (all jobs):
       READ: bw=82.9MiB/s (86.9MB/s), 82.9MiB/s-82.9MiB/s (86.9MB/s-86.9MB/s), io=4982MiB (5223MB), run=60106-60106msec

- Test randread:
    fio --name=write_throughput --directory="/home/csdeptucy/ssfs" --numjobs=16 --size=4KB --time_based --runtime=60s --ramp_time=2s --ioengine=libaio --verify=0 --bs=4KB --iodepth=64 --rw=randread --group_reporting=1 --iodepth_batch_submit=64 --iodepth_batch_complete_max=64

    Result:
    Jobs: 16 (f=16): [r(16)][100.0%][r=9984KiB/s][r=2496 IOPS][eta 00m:00s]
    write_throughput: (groupid=0, jobs=16): err= 0: pid=4807: Sat May 27 14:01:41 2023
      read: IOPS=20.5k, BW=80.0MiB/s (83.9MB/s)(4816MiB/60197msec)
        slat (msec): min=10, max=730, avg=49.88, stdev=57.86
        clat (usec): min=2, max=349, avg=14.97, stdev=20.24
         lat (msec): min=10, max=730, avg=49.91, stdev=57.88
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[    9], 50.00th=[   10], 60.00th=[   10],
         | 70.00th=[   11], 80.00th=[   12], 90.00th=[   16], 95.00th=[   65],
         | 99.00th=[   87], 99.50th=[  105], 99.90th=[  231], 99.95th=[  258],
         | 99.99th=[  322]
       bw (  KiB/s): min= 8033, max=180378, per=100.00%, avg=82035.58, stdev=3384.73, samples=1917
       iops        : min= 2002, max=45090, avg=20504.31, stdev=846.16, samples=1917
      lat (usec)   : 4=0.86%, 10=62.16%, 20=27.84%, 50=1.33%, 100=7.19%
      lat (usec)   : 250=0.56%, 500=0.07%
      cpu          : usr=0.22%, sys=2.19%, ctx=1251096, majf=0, minf=240
      IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
         submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         issued rwts: total=1231872,0,0,0 short=0,0,0,0 dropped=0,0,0,0
         latency   : target=0, window=0, percentile=100.00%, depth=64

    Run status group 0 (all jobs):
       READ: bw=80.0MiB/s (83.9MB/s), 80.0MiB/s-80.0MiB/s (83.9MB/s-83.9MB/s), io=4816MiB (5050MB), run=60197-60197msec

Test randwrite:
    fio --name=write_throughput --directory="/home/csdeptucy/ssfs" --numjobs=16 --size=4KB --time_based --runtime=60s --ramp_time=2s --ioengine=libaio --verify=0 --bs=4KB --iodepth=64 --rw=randwrite --group_reporting=1 --iodepth_batch_submit=64 --iodepth_batch_complete_max=64
    Result:
      write: IOPS=22.4k, BW=87.4MiB/s (91.6MB/s)(5253MiB/60116msec); 0 zone resets
        slat (msec): min=13, max=701, avg=45.70, stdev=49.21
        clat (usec): min=2, max=400, avg=14.07, stdev=18.65
         lat (msec): min=13, max=701, avg=45.68, stdev=49.21
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[    9], 50.00th=[    9], 60.00th=[   10],
         | 70.00th=[   11], 80.00th=[   11], 90.00th=[   14], 95.00th=[   64],
         | 99.00th=[   85], 99.50th=[   99], 99.90th=[  188], 99.95th=[  225],
         | 99.99th=[  318]
       bw (  KiB/s): min= 8150, max=181218, per=99.88%, avg=89367.15, stdev=3442.61, samples=1919
       iops        : min= 2032, max=45300, avg=22336.66, stdev=860.60, samples=1919
      lat (usec)   : 4=0.94%, 10=68.93%, 20=21.91%, 50=1.14%, 100=6.59%
      lat (usec)   : 250=0.45%, 500=0.03%
      cpu          : usr=0.25%, sys=2.54%, ctx=1346043, majf=0, minf=244
      IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
         submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         issued rwts: total=0,1343744,0,0 short=0,0,0,0 dropped=0,0,0,0
         latency   : target=0, window=0, percentile=100.00%, depth=64

    Run status group 0 (all jobs):
      WRITE: bw=87.4MiB/s (91.6MB/s), 87.4MiB/s-87.4MiB/s (91.6MB/s-91.6MB/s), io=5253MiB (5508MB), run=60116-60116msec

Test readwrite: (Sequential mixed reads and writes.)
    fio --name=write_throughput --directory="/home/csdeptucy/ssfs" --numjobs=16 --size=4KB --time_based --runtime=60s --ramp_time=2s --ioengine=libaio --verify=0 --bs=4KB --iodepth=64 --rw=readwrite --group_reporting=1 --iodepth_batch_submit=64 --iodepth_batch_complete_max=64

    write_throughput: (groupid=0, jobs=16): err= 0: pid=5073: Sat May 27 14:08:43 2023
      read: IOPS=11.7k, BW=45.6MiB/s (47.8MB/s)(2744MiB/60172msec)
        slat (msec): min=11, max=698, avg=43.77, stdev=36.09
        clat (usec): min=2, max=386, avg=16.59, stdev=23.58
         lat (msec): min=11, max=698, avg=43.80, stdev=36.10
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    9], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[   10], 50.00th=[   10], 60.00th=[   11],
         | 70.00th=[   12], 80.00th=[   13], 90.00th=[   25], 95.00th=[   67],
         | 99.00th=[  103], 99.50th=[  155], 99.90th=[  249], 99.95th=[  289],
         | 99.99th=[  375]
       bw (  KiB/s): min= 3762, max=82021, per=100.00%, avg=46699.04, stdev=1240.51, samples=1920
       iops        : min=  934, max=20502, avg=11670.39, stdev=310.15, samples=1920
      write: IOPS=11.7k, BW=45.5MiB/s (47.8MB/s)(2740MiB/60172msec); 0 zone resets
        slat (msec): min=11, max=698, avg=43.71, stdev=36.15
        clat (usec): min=2, max=386, avg=16.58, stdev=23.49
         lat (msec): min=11, max=698, avg=43.74, stdev=36.16
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    9], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[   10], 50.00th=[   10], 60.00th=[   11],
         | 70.00th=[   12], 80.00th=[   13], 90.00th=[   25], 95.00th=[   67],
         | 99.00th=[  103], 99.50th=[  155], 99.90th=[  245], 99.95th=[  281],
         | 99.99th=[  367]
       bw (  KiB/s): min= 3854, max=81368, per=99.99%, avg=46630.83, stdev=1238.03, samples=1920
       iops        : min=  955, max=20339, avg=11653.21, stdev=309.53, samples=1920
      lat (usec)   : 4=0.70%, 10=54.35%, 20=34.01%, 50=2.19%, 100=7.68%
      lat (usec)   : 250=0.97%, 500=0.10%
      cpu          : usr=0.28%, sys=2.92%, ctx=1416515, majf=0, minf=256
      IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
         submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         issued rwts: total=701976,701032,0,0 short=0,0,0,0 dropped=0,0,0,0
         latency   : target=0, window=0, percentile=100.00%, depth=64

    Run status group 0 (all jobs):
       READ: bw=45.6MiB/s (47.8MB/s), 45.6MiB/s-45.6MiB/s (47.8MB/s-47.8MB/s), io=2744MiB (2877MB), run=60172-60172msec
      WRITE: bw=45.5MiB/s (47.8MB/s), 45.5MiB/s-45.5MiB/s (47.8MB/s-47.8MB/s), io=2740MiB (2873MB), run=60172-60172msec

Test randrw: (Random mixed reads and writes.)
    fio --name=write_throughput --directory="/home/csdeptucy/ssfs" --numjobs=16 --size=4KB --time_based --runtime=60s --ramp_time=2s --ioengine=libaio --verify=0 --bs=4KB --iodepth=64 --rw=randrw --group_reporting=1 --iodepth_batch_submit=64 --iodepth_batch_complete_max=64

    Results:
      read: IOPS=8206, BW=32.1MiB/s (33.6MB/s)(1929MiB/60112msec)
        slat (msec): min=13, max=502, avg=62.30, stdev=59.40
        clat (usec): min=2, max=409, avg=15.01, stdev=21.03
         lat (msec): min=13, max=502, avg=62.33, stdev=59.43
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[   10], 50.00th=[   10], 60.00th=[   10],
         | 70.00th=[   11], 80.00th=[   12], 90.00th=[   15], 95.00th=[   65],
         | 99.00th=[   95], 99.50th=[  125], 99.90th=[  223], 99.95th=[  281],
         | 99.99th=[  383]
       bw (  KiB/s): min= 4416, max=80713, per=99.99%, avg=32854.16, stdev=1563.34, samples=1920
       iops        : min= 1098, max=20175, avg=8210.68, stdev=390.85, samples=1920
      write: IOPS=8203, BW=32.1MiB/s (33.6MB/s)(1928MiB/60112msec); 0 zone resets
        slat (msec): min=13, max=502, avg=62.17, stdev=59.27
        clat (usec): min=2, max=409, avg=15.02, stdev=21.09
         lat (msec): min=13, max=502, avg=62.20, stdev=59.30
        clat percentiles (usec):
         |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
         | 30.00th=[    9], 40.00th=[   10], 50.00th=[   10], 60.00th=[   10],
         | 70.00th=[   11], 80.00th=[   12], 90.00th=[   15], 95.00th=[   65],
         | 99.00th=[   95], 99.50th=[  125], 99.90th=[  229], 99.95th=[  281],
         | 99.99th=[  383]
       bw (  KiB/s): min= 4387, max=81630, per=99.98%, avg=32843.07, stdev=1565.04, samples=1920
       iops        : min= 1093, max=20405, avg=8207.96, stdev=391.28, samples=1920
      lat (usec)   : 4=0.84%, 10=60.91%, 20=29.17%, 50=1.81%, 100=6.37%
      lat (usec)   : 250=0.83%, 500=0.07%
      cpu          : usr=0.21%, sys=1.90%, ctx=995577, majf=0, minf=241
      IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
         submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=100.0%, >=64=0.0%
         issued rwts: total=493288,493144,0,0 short=0,0,0,0 dropped=0,0,0,0
         latency   : target=0, window=0, percentile=100.00%, depth=64

    Run status group 0 (all jobs):
       READ: bw=32.1MiB/s (33.6MB/s), 32.1MiB/s-32.1MiB/s (33.6MB/s-33.6MB/s), io=1929MiB (2023MB), run=60112-60112msec
      WRITE: bw=32.1MiB/s (33.6MB/s), 32.1MiB/s-32.1MiB/s (33.6MB/s-33.6MB/s), io=1928MiB (2022MB), run=60112-60112msec